{
    "name": "BIOE 215",
    "title": "Advanced Seminar in Ecology and Evolutionary Biology",
    "description": "Intensive exploration of an advanced topic in theoretical or applied evolutionary biology, ecology, physiology, behavior, or conservation biology. Course consists of weekly meetings with extensive independent work outside of class, resulting in mastery of an area of innovation in the field, or in a comprehensive familiarity with an important body of work. Independent work generally culminates in independent or group projects and products. Course is targeted at students who already have reached a professional level of expertise in their field and advanced master's students. (Formerly offered as BIOE 295, Advanced Ecology and Evolutionary Biology Seminar.)\n May be repeated for credit.",
    "pre_req_data": {
        "conditions": {
            "restricted_to_majors": "",
            "erlw": false,
            "lower_credits_limit": 0,
            "upper_credits_limit": 500,
            "College 1": "",
            "Concurrent": ""
        },
        "text": "Enrollment is restricted to graduate students, except by special permission.",
        "courses": []
    },
    "class_notes": "Data Science for Eco/Evo, taught by NOAA Postdoctoral Scholar Max Czapanskiy. This course will aim to be practical and provide structure for learning the computational skills most eco/evo grad students have to pick up on their own. Topics will include programming best practices in R, organizing data and computational projects, and planning for reproducibility. This is a chance to gain knowledge and experience with the nuts and bolts of making your science work in code, without trying to learn generalized linear models at the same time. The course structure will be self-directed for weeks 1-6, followed by a final project in weeks 7-10.",
    "career": "Graduate",
    "gen_ed_code": "NULL",
    "type": "Seminar",
    "credits": "3",
    "quarters_offered": [
        "fall",
        "spring",
        "winter"
    ],
    "quarterly_info": {
        "fall": {
            "total_seats": 40,
            "filled seats": 24,
            "priority": "low"
        },
        "spring": {
            "total_seats": 55,
            "filled seats": 20,
            "priority": "very low"
        },
        "winter": {
            "total_seats": 20,
            "filled seats": 0,
            "priority": "very low"
        }
    }
}